<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Lab-5:-Regular-Expressions,-SQL" data-toc-modified-id="Lab-5:-Regular-Expressions,-SQL-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Lab 5: Regular Expressions, SQL</a></span><ul class="toc-item"><li><span><a href="#Objectives-for-Lab-5:" data-toc-modified-id="Objectives-for-Lab-5:-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Objectives for Lab 5:</a></span></li></ul></li><li><span><a href="#Part-1:-Regular-Expressions" data-toc-modified-id="Part-1:-Regular-Expressions-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Part 1: Regular Expressions</a></span></li><li><span><a href="#Question-1" data-toc-modified-id="Question-1-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Question 1</a></span><ul class="toc-item"><li><span><a href="#Question-1a" data-toc-modified-id="Question-1a-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Question 1a</a></span></li><li><span><a href="#Question-1b" data-toc-modified-id="Question-1b-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Question 1b</a></span></li></ul></li><li><span><a href="#Question-2" data-toc-modified-id="Question-2-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Question 2</a></span><ul class="toc-item"><li><span><a href="#Question-2a:" data-toc-modified-id="Question-2a:-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Question 2a:</a></span></li><li><span><a href="#Question-2b:" data-toc-modified-id="Question-2b:-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Question 2b:</a></span></li><li><span><a href="#Question-2c:" data-toc-modified-id="Question-2c:-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Question 2c:</a></span></li><li><span><a href="#Question-2d:" data-toc-modified-id="Question-2d:-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Question 2d:</a></span></li><li><span><a href="#Question-2e:" data-toc-modified-id="Question-2e:-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Question 2e:</a></span></li><li><span><a href="#Question-2f:" data-toc-modified-id="Question-2f:-4.6"><span class="toc-item-num">4.6&nbsp;&nbsp;</span>Question 2f:</a></span></li></ul></li><li><span><a href="#Part-2:-SQL" data-toc-modified-id="Part-2:-SQL-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Part 2: SQL</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Connecting-to-SQLite" data-toc-modified-id="Connecting-to-SQLite-5.0.1"><span class="toc-item-num">5.0.1&nbsp;&nbsp;</span>Connecting to SQLite</a></span></li></ul></li><li><span><a href="#Table-Descriptions" data-toc-modified-id="Table-Descriptions-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Table Descriptions</a></span></li><li><span><a href="#Question-3" data-toc-modified-id="Question-3-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Question 3</a></span><ul class="toc-item"><li><span><a href="#Question-3a" data-toc-modified-id="Question-3a-5.2.1"><span class="toc-item-num">5.2.1&nbsp;&nbsp;</span>Question 3a</a></span></li><li><span><a href="#Question-3b" data-toc-modified-id="Question-3b-5.2.2"><span class="toc-item-num">5.2.2&nbsp;&nbsp;</span>Question 3b</a></span></li><li><span><a href="#Question-3c" data-toc-modified-id="Question-3c-5.2.3"><span class="toc-item-num">5.2.3&nbsp;&nbsp;</span>Question 3c</a></span></li></ul></li></ul></li></ul></div>

# Lab 5: Regular Expressions, SQL

In [7]:
import pandas as pd
import numpy as np
import re
import sqlalchemy

from ds100_utils import fetch_and_cache
from pathlib import Path

## Objectives for Lab 5:

This lab has two main parts. 

In the first part, you will practice the basic usage of regular expressions and also learn to use `re` module in Python.  Some of the materials are based on the tutorial at http://opim.wharton.upenn.edu/~sok/idtresources/python/regex.pdf. As you work through the first part of the lab, we suggest you to use the website http://regex101.com, especially when you have difficulties matching your answer with the asked part of string. 

In the second part of the lab, we are going to practice viewing, sorting, grouping, and merging tables with SQL.

---
# Part 1: Regular Expressions

We'll start by learning about the simplest possible regular expressions. Since regular expressions are used
to operate on strings, we'll start with the most common task: matching characters.

Most letters and characters will simply match themselves. For example, the regular expression `r'test'` will match the string `test` exactly. There are exceptions to this rule; some characters are special, and don't match themselves.

Here is a list of metacharacters that are widely used in regular experssion. 

<table border="1" class="dataframe" >
<thead>
  <tr style="text-align: right;">
    <th>Pattern </th>
    <th>Description</th> 
  </tr>
 </thead>
 <tbody>
  <tr>
    <td>^</td>
    <td>Matches beginning of line.</td> 
  </tr>
  <tr>
    <td>$</td>
    <td>Matches end of line.</td> 
  </tr>
  <tr>
    <td>.</td>
    <td>Matches any single character except newline. </td> 
  </tr>
  <tr>
    <td>*</td>
    <td>Matches 0 or more occurrences of preceding expression.</td>
  </tr>
  <tr>
    <td>+</td>
    <td>Matches 1 or more occurrence of preceding expression.</td>
  </tr>
  <tr>
    <td>?</td>
    <td>Matches 0 or 1 occurrence of preceding expression.</td>
  </tr>
  <tr>
    <td>[...]</td>
    <td>Matches any single character in brackets.</td>
  </tr>
  <tr>
    <td>[^...]</td>
    <td>Matches any single character <b>not</b> in brackets.</td>
  </tr>
  <tr>
    <td>{n}</td>
    <td>Matches exactly n number of occurrences of preceding expression.</td>
  </tr>
  <tr>
    <td>{n,}</td>
    <td>Matches n or more occurrences of preceding expression.</td>
  </tr>
  <tr>
    <td>{n,m}</td>
    <td>Matches at least n and at most m occurrences of preceding expression.</td>
  </tr>
  <tr>
    <td>a|b</td>
    <td>Matches either a or b.</td>
  </tr>
  <tr>
    <td>\1...\9</td>
    <td>Matches n-th grouped subexpression.</td>
  </tr>
  </tbody>
</table>


Perhaps the most important metacharacter is the backslash, ‘\’. As in Python string literals, the backslash
can be followed by various characters to signal various special sequences. It’s also used to escape all the
metacharacters so you can still match them in patterns; for example, if you need to match a `[` or `\`, you
can precede them with a backslash to remove their special meaning:  `\[` or `\\`. 

The following predefined special sequences are available:

<table border="1" class="dataframe" >
<thead>
  <tr style="text-align: right;">
    <th>Pattern </th>
    <th>Description</th> 
  </tr>
 </thead>
 <tbody>
  <tr>
    <td>\d</td>
    <td>Matches any decimal digit; this is equivalent to the class `[0-9]`</td> 
  </tr>
  <tr>
    <td>\D</td>
    <td>Matches any non-digit character; this is equivalent to the class `[^0-9]`.</td> 
  </tr>
  <tr>
    <td>\s</td>
    <td>Matches any whitespace character; this is equivalent to the class `[ \t\n\r\f\v]` </td> 
  </tr>
  <tr>
    <td>\S</td>
    <td>Matches any non-whitespace character; this is equivalent to the class `[^ \t\n\r\f\v]`.</td>
  </tr>
  <tr>
    <td>\w</td>
    <td>Matches any alphanumeric character; this is equivalent to the class `[a-zA-Z0-9_]`</td>
  </tr>
  <tr>
    <td>\W</td>
    <td>Matches any non-alphanumeric character; this is equivalent to the class `[^a-zA-Z0-9_]`.</td>
  </tr>
  </tbody>
</table>

# Question 1
In this question, write patterns that match the given sequences. It may be as simple as the common letters on each line.

---
## Question 1a

Write a single regular expression to match the following strings without using the `|` operator.

1. **Match:** `abcdefg`
1. **Match:** `abcde`
1. **Match:** `abc`
1. **Skip:** `c abc`

In [8]:
regx1 = r"^[^c][a-z]+" # fill in your pattern

---
## Question 1b

Write a single regular expression to match the following strings without using the `|` operator.

1. **Match:** `can`
1. **Match:** `man`
1. **Match:** `fan`
1. **Skip:** `dan`
1. **Skip:** `ran`
1. **Skip:** `pan`

In [9]:
regx2 = r"[mcf]an" # fill in your pattern

# Question 2

Now that we have written a few regular expressions, we are now ready to move beyond matching. In this question, we'll take a look at some methods from the `re` package.

---
## Question 2a:

Write a Python program to extract and print the numbers of a given string. 

1. **Hint:** use `re.findall`
2. **Hint:** use `\d` for digits and one of either `*` or `+`.

In [10]:
text_q2a = "Ten 10, Twenty 20, Thirty 30"

res_q2a = re.findall('[0-9]+',text_q2a)
...

res_q2a

['10', '20', '30']

---
## Question 2b:

Write a Python program to replace at most 2 occurrences of space, comma, or dot with a colon.

**Hint:** use `re.sub(regex, "newtext", string, number_of_occurences)`

In [15]:
text_q2b = 'Python Exercises, PHP exercises.'
res_q2b = re.sub(r'\,|\.|\s',':',text_q2b,2) # Hint: use re.sub()
...

res_q2b

'Python:Exercises: PHP exercises.'

---
## Question 2c: 

Write a Python program to extract values between quotation marks of a string.

**Hint:** use `re.findall`

In [17]:
text_q2c = '"Python", "PHP", "Java"'
res_q2c = re.findall('[a-zA-Z]+',text_q2c)
...

res_q2c

['Python', 'PHP', 'Java']

## Question 2d:

Write a regular expression to extract and print the quantity and type of objects in a string. You may assume that a space separates quantity and type, ie. `"{quantity} {type}"`. See the example string below for more detail.

1. **Hint:** use `re.findall`
2. **Hint:** use `\d` for digits and one of either `*` or `+`.

In [19]:
text_q2d = "I've got 10 eggs that I stole from 20 gooses belonging to 30 giants."

res_q2d = re.findall('\d+\s[A-Za-z]+',text_q2d)
...

res_q2d

['10 eggs', '20 gooses', '30 giants']

## Question 2e:

Write a regular expression to replace all vowels with a lowercase letter “o”. Given that address is a string, use re.sub to change "123 Orange Street" into "123 orongo Stroot". This question is from Disc05, Question #7.

**Hint:** use `re.sub(regex, "newtext", string, number_of_occurences)`

In [21]:
text_q2e = "123 Orange Street"

res_q2e = re.sub('[aeiouAEIOU]', "o", text_q2e)
...

res_q2e

'123 orongo Stroot'

## Question 2f:

This question comes from the RegEx puzzle from lecture. Fill in the regular expression in the variable pattern below so that after it executes, day is 26, month is Jan, and year is 2014.

1. **Hint:** use `re.findall`
2. **Hint:** pay attention to the data type after using `re.findall`
3. **Hint:** use `\[` and `\/` to match the character '[' and '/'.

In [23]:
text_q2f = '169.237.46.168 - - [26/Jan/2014:10:47:58 -0800]'
pattern = r'(\d+)\/(\w+)\/(\d+)' # Hint: only pattern has to be regular expression
day = re.findall(pattern,text_q2f)[0][0] # day, month, year all depend on pattern
month = re.findall(pattern,text_q2f)[0][1]
year = re.findall(pattern,text_q2f)[0][2]
...
pattern = re.findall(pattern,text_q2f)[0]

# Part 2: SQL

In the rest of the lab, we explore the money donated during the 2016 election using the [Federal Election
Commission's public records](http://www.fec.gov/finance/disclosure/ftpdet.shtml). You will be connecting to a sqlite database containing the data. The data we will be working with in this lab is quite small (16MB); however, it's taken from a larger database that more than few GBs!

It seems there are many questions left to be finish, but there aren't. Don't panic; don't stress. **You only have 3 questions to complete. **

### Connecting to SQLite

Download the database to local disk drive; this will take about a minute.

In [30]:
db_url = 'https://s3.amazonaws.com/berkeley-ds100/fec_nyc.sqlite'
db_filename = 'fec_nyc.db'
data_dir = Path('data')
fetch_and_cache(db_url, db_filename, data_dir=data_dir)
db_path = data_dir / db_filename

Using version already downloaded: Tue Oct 27 08:14:52 2020
MD5 hash of file: eb00aba8bf8265b31e4e80554ed9a4cf

The following cell will connect to the above database using the SQL Alchemy library. This library is more general than the `sqlite3` module from the standard library because it can connect to several different database management systems, such as MySQL and PostgreSQL. It also supports an advanced feature for generating queries called an [object relational mapper](https://docs.sqlalchemy.org/en/latest/orm/tutorial.html) or ORM, which we won't discuss in this course but is quite useful for application development.

In [32]:
engine = sqlalchemy.create_engine(f"sqlite:///{db_path}")
connection = engine.connect()

To check that everything is working we will list the available tables.

In [33]:
engine.table_names()

['cand', 'comm', 'indiv_sample_nyc']

## Table Descriptions

Here is a list of the tables in the database.  Each table links to the documentation on the [FEC page](http://www.fec.gov/finance/disclosure/ftpdet.shtml) for the dataset.

Note that the table names here are slightly different from the ones in lecture. Consult the FEC page
for the descriptions of the tables to find out what the correspondence is.

- [`cand`](http://www.fec.gov/finance/disclosure/metadata/DataDictionaryCandidateMaster.shtml): Candidates table. Contains names and party affiliation.
- [`comm`](http://www.fec.gov/finance/disclosure/metadata/DataDictionaryCommitteeMaster.shtml): Committees table. Contains committee names and types.
- [`indiv_sample_nyc`](http://www.fec.gov/finance/disclosure/metadata/DataDictionaryContributionsbyIndividuals.shtml): All individual contributions from New York City.

We can explore the schemas of these tables with the following code from lecture 8.

In [36]:
for exp in connection.execute('SELECT sql FROM sqlite_master;'):
    print(exp[0])

CREATE TABLE "cand" (
    cand_id character varying(9),
    cand_name text,
    cand_pty_affiliation character varying(3),
    cand_election_yr integer,
    cand_office_st character varying(2),
    cand_office character(1),
    cand_office_district integer,
    cand_ici character(1),
    cand_status character(1),
    cand_pcc character varying(9),
    cand_st1 text,
    cand_st2 text,
    cand_city text,
    cand_st character varying(2),
    cand_zip character varying(10)
)
CREATE TABLE "comm"(
  "cmte_id" TEXT,
  "cmte_nm" TEXT,
  "tres_nm" TEXT,
  "cmte_st1" TEXT,
  "cmte_st2" TEXT,
  "cmte_city" TEXT,
  "cmte_st" TEXT,
  "cmte_zip" TEXT,
  "cmte_dsgn" TEXT,
  "cmte_tp" TEXT,
  "cmte_pty_affiliation" TEXT,
  "cmte_filing_freq" TEXT,
  "org_tp" TEXT,
  "connected_org_nm" TEXT,
  "cand_id" TEXT
)
CREATE TABLE indiv_sample_nyc (
    cmte_id character varying(9),
    amndt_ind character(1),
    rpt_tp character varying(3),
    transaction_pgi character(5),
    image_num bigint,
    transaction_tp character varying(3),
    entity_tp character varying(3),
    name text,
    city text,
    state character(2),
    zip_code character varying(12),
    employer text,
    occupation text,
    transaction_dt character varying(9),
    transaction_amt integer,
    other_id text,
    tran_id text,
    file_num bigint,
    memo_cd text,
    memo_text text,
    sub_id bigint
)

In [37]:
query = '''
SELECT cand_id, cand_name
FROM cand
WHERE cand_pty_affiliation = 'DEM'
LIMIT 5
'''
pd.read_sql(query,engine)

     cand_id                    cand_name
0  H0AL05049    CRAMER, ROBERT E "BUD" JR
1  H0AL07086     SEWELL, TERRYCINA ANDREA
2  H0AL07094  HILLIARD, EARL FREDERICK JR
3  H0AR01091   GREGORY, JAMES CHRISTOPHER
4  H0AR01109                 CAUSEY, CHAD

---
## Question 3

For this question we will use regular expressions and sampling to extract data out of the `indiv_sample_nyc` table.

In [39]:
for exp in connection.execute('SELECT sql FROM sqlite_master WHERE name="indiv_sample_nyc";'):
    print(exp[0])

CREATE TABLE indiv_sample_nyc (
    cmte_id character varying(9),
    amndt_ind character(1),
    rpt_tp character varying(3),
    transaction_pgi character(5),
    image_num bigint,
    transaction_tp character varying(3),
    entity_tp character varying(3),
    name text,
    city text,
    state character(2),
    zip_code character varying(12),
    employer text,
    occupation text,
    transaction_dt character varying(9),
    transaction_amt integer,
    other_id text,
    tran_id text,
    file_num bigint,
    memo_cd text,
    memo_text text,
    sub_id bigint
)

### Question 3a

Let's first select transactions in the `indiv_sample_nyc` table with a `cmte_id` (committee id) that ends in 5. Then, groupby the transactions in the `indiv_sample_nyc` table with the `cmte_id` column, and count how many transactions and how much total amount of contribution there are for each `cmte_id`. Select the top 5 committees ordered by the transaction count.

Your output should look similar to:

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>committee_id</th>
      <th>total_amount</th>
      <th>count</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>C00575795</td>
      <td>25099091</td>
      <td>110657</td>
    </tr>
    <tr>
      <th>1</th>
      <td>C00000935</td>
      <td>6989835</td>
      <td>36237</td>
    </tr>
    <tr>
      <th>2</th>
      <td>C00035675</td>
      <td>316019</td>
      <td>3417</td>
    </tr>
    <tr>
      <th>3</th>
      <td>C00040535</td>
      <td>492567</td>
      <td>3277</td>
    </tr>
    <tr>
      <th>4</th>
      <td>C00012245</td>
      <td>499659</td>
      <td>2128</td>
    </tr>
  </tbody>
</table>

In [43]:
query = """
SELECT * from indiv_sample_nyc LIMIT 5
"""
pd.read_sql(query, engine)

,cmte_id,amndt_ind,rpt_tp,transaction_pgi,image_num,transaction_tp,entity_tp,name,city,state,...,employer,occupation,transaction_dt,transaction_amt,other_id,tran_id,file_num,memo_cd,memo_text,sub_id
0,C00445015,N,Q1,P,15951128130,15,IND,"SINGER, TRIPP MR.",NEW YORK,NY,...,"ATLANTIC MAILBOXES, INC.",OWNER,01302015,1000,,A-CF13736,1002485,,,4041420151241812398
1,C00510461,N,Q1,P,15951129284,15E,IND,"SIMON, DANIEL A",NEW YORK,NY,...,N/A,RETIRED,03292015,400,C00401224,VN8JBDDJBA8,1002590,,* EARMARKED CONTRIBUTION: SEE BELOW,4041420151241813640
2,C00422410,N,Q1,P,15970352211,15,IND,"ABDUL RAUF, FEISAL",NEW YORK,NY,...,THE CORDOBA INITIATIVE,CHAIRMAN,03042015,250,,VN8A3DBSYG6,1003643,,,4041620151241914560
3,C00510461,N,Q1,P,15951129280,15,IND,"SCHWARZER, FRANK",NEW YORK,NY,...,METRO HYDRAULIC JACK CO,SALES,01162015,100,,VN8JBDAP4C4,1002590,,* EARMARKED CONTRIBUTION: SEE BELOW,4041420151241813630
4,C00510461,N,Q1,P,15951129281,15,IND,"SCHWARZER, FRANK",NEW YORK,NY,...,METRO HYDRAULIC JACK CO,SALES,02162015,100,,VN8JBDBRDG3,1002590,,* EARMARKED CONTRIBUTION: SEE BELOW,4041420151241813632

In [44]:
query_q3a='''
SELECT
    cmte_id AS committee_id,
    SUM(transaction_amt) AS total_amount,
    COUNT(cmte_id) AS count
FROM indiv_sample_nyc
WHERE cmte_id LIKE '%5'
GROUP BY cmte_id
ORDER BY count DESC
LIMIT 5

'''
...

res_q3a = pd.read_sql(query_q3a, engine)
res_q3a

  committee_id  total_amount   count
0    C00575795      25099091  110657
1    C00000935       6989835   36237
2    C00035675        316019    3417
3    C00040535        492567    3277
4    C00012245        499659    2128

### Question 3b

When you printed the schema for the tables, you may have noticed that both the `cand` and `comm` tables have a `cand_id` column. Let's try joining these two tables on this column.

List the first 5 candidate names (`cand_name`) in reverse lexicographic order by `cand_name`, along with their corresponding committee names. Only select rows that have a matching `cand_id` in both tables.

Your output should look similar to:

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>cand_name</th>
      <th>cmte_nm</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>ZUTLER, DANIEL PAUL MR</td>
      <td>CITIZENS TO ELECT DANIEL P ZUTLER FOR PRESIDENT</td>
    </tr>
    <tr>
      <th>1</th>
      <td>ZUMWALT, JAMES</td>
      <td>ZUMWALT FOR CONGRESS</td>
    </tr>
    <tr>
      <th>2</th>
      <td>ZUKOWSKI, ANDREW GEORGE</td>
      <td>ZUKOWSKI FOR CONGRESS</td>
    </tr>
    <tr>
      <th>3</th>
      <td>ZUCCOLO, JOE</td>
      <td>JOE ZUCCOLO FOR CONGRESS</td>
    </tr>
    <tr>
      <th>4</th>
      <td>ZORN, ROBERT ERWIN</td>
      <td>CONSTITUTIONAL COMMITTEE</td>
    </tr>
  </tbody>
</table>

In [46]:
query_q3b='''
SELECT cand_name, cmte_nm
FROM cand c1 INNER JOIN comm c2 ON c1.cand_id = c2.cand_id
GROUP BY cand_name
ORDER BY cand_name DESC
LIMIT 5
'''
...

res_q3b = pd.read_sql(query_q3b, engine)
res_q3b

                 cand_name                                          cmte_nm
0   ZUTLER, DANIEL PAUL MR  CITIZENS TO ELECT DANIEL P ZUTLER FOR PRESIDENT
1           ZUMWALT, JAMES                             ZUMWALT FOR CONGRESS
2  ZUKOWSKI, ANDREW GEORGE                            ZUKOWSKI FOR CONGRESS
3             ZUCCOLO, JOE                         JOE ZUCCOLO FOR CONGRESS
4       ZORN, ROBERT ERWIN                         CONSTITUTIONAL COMMITTEE

### Question 3c

As in the previous part, list the first 5 candidate names (`cand_name`) by reverse lexicographic order and their corresponding committee names (`cmte_nm`). This time, include all candidate names. If there is no matching `cand_id` in the `comm` table, then `cmte_nm` should be NULL.

Your output should look similar to:

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>cand_name</th>
      <th>cmte_nm</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>ZUTLER, DANIEL PAUL MR</td>
      <td>CITIZENS TO ELECT DANIEL P ZUTLER FOR PRESIDENT</td>
    </tr>
    <tr>
      <th>1</th>
      <td>ZUMWALT, JAMES</td>
      <td>ZUMWALT FOR CONGRESS</td>
    </tr>
    <tr>
      <th>2</th>
      <td>ZUKOWSKI, ANDREW GEORGE</td>
      <td>ZUKOWSKI FOR CONGRESS</td>
    </tr>
    <tr>
      <th>3</th>
      <td>ZUCCOLO, JOE</td>
      <td>JOE ZUCCOLO FOR CONGRESS</td>
    </tr>
    <tr>
      <th>4</th>
      <td>ZORNOW, TODD MR</td>
      <td>None</td>
    </tr>
  </tbody>
</table>

<!--
BEGIN QUESTION
name: q3c
-->

In [47]:
query_q3c='''
SELECT cand_name,cmte_nm
FROM cand c1 LEFT JOIN comm c2 ON c1.cand_id = c2.cand_id
GROUP BY cand_name
ORDER BY cand_name DESC
LIMIT 5
'''
...

res_q3c = pd.read_sql(query_q3c, engine)
res_q3c

                 cand_name                                          cmte_nm
0   ZUTLER, DANIEL PAUL MR  CITIZENS TO ELECT DANIEL P ZUTLER FOR PRESIDENT
1           ZUMWALT, JAMES                             ZUMWALT FOR CONGRESS
2  ZUKOWSKI, ANDREW GEORGE                            ZUKOWSKI FOR CONGRESS
3             ZUCCOLO, JOE                         JOE ZUCCOLO FOR CONGRESS
4          ZORNOW, TODD MR                                             None